[
    {
        "id": 1,
        "name": "Pani Puri",
        "ingredients": "Potatoes,Onion,chopped coriander,roasted cumin powder,chaat masala powder,red chili powder,black salt or regular salt or pink salt,chopped mint leaves,ginger,green chilies,tamarind,jaggery powder,water,boondi",
        "directions": "Take the sooji in a big bowl, add oil and water gradually. Knead it into a smooth dough that shoul not be too stick or too tight. Cover the dough, let it rest for 15-20 minutes. Now, pull out small units from the smooth dough and roll them flat using a rolling pin. In a khadi, hear some oil and start frying the sooji purush one by one. Fry until they puff up and turn golden brown from both ends. Switch off the heat when done strain and let it cool and serve.",
        "description": "Panipuri, phuchka, gupchup, golgappa, or pani ke patashe is a type of snack that originates from India, and is one of the most common street foods there.",
        "calories": "350",
        "image": "https://www.awesomecuisine.com/wp-content/uploads/2007/11/Pani-Puri.jpg"
    },
    {
        "id": 2,
        "name": "Maggi",
        "ingredients": "Maggi noodles,Salt,Turmeric powder,Black-pepper powder,Tomato ketchup,Water",
        "directions": "Take water in the pan and bring it to boil.Add Maggi seasoning, salt,turmeric powder and black- pepper powder to it. Add Maggi noodles. Bring it to boil on high flame and then reduce the heat. Add tomato ketchup. Allow it to cook on simmer for a couple of minutes. Now, serve the Maggi noodles.",
        "description": "Maggi is an international brand of seasonings, instant soups, and noodles that originated in Switzerland in the late 19th century. The Maggi company was acquired by Nestlé in 1947.",
        "calories": "200",
        "image": "https://asmallbite.com/wp-content/uploads/2018/05/Maggi-Noodles-Recipe-1-450x375.jpg"
    },
    {
        "id": 3,
        "name": "Watermelon Mint Juice",
        "ingredients": "Watermelon,Mint Leaves,Sugar,Ice-cubes",
        "directions": "Take the chilled watermelon and cut into half. Farmhouse Watermelon Mint Juice recipe step 1 photo Farmhouse Watermelon Mint Juice recipe step 1 photo Then cut the watermelon into small pieces. Farmhouse Watermelon Mint Juice recipe step 2 photo Now, take some fresh mint leaves and blend them with the watermelon in mixer or juicer. Then add sugar. Strain it into another vessel if blending in a normal mixer. Farmhouse Watermelon Mint Juice recipe step 3 photo Farmhouse Watermelon Mint Juice recipe step 3 photo After that pour this Farmhouse Watermelon Mint Juice in the glaases, garnish it with a mint leaf or leaves and pieces of watermelon and serve immediately....😋",
        "description": "Blend the watermelon and mint to a puree in a blender or using a hand blender. Keep a few watermelon cubes and mint leaves aside for serving.",
        "calories": "550",
        "image": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2010/4/5/0/VM0104_Watermelon-and-Mint-Agua-Fresca_s4x3.jpg.rend.hgtvcom.406.305.suffix/1393125639338.jpeg"
    },
    {
        "id": 4,
        "name": "Mango Dalgona Lassi",
        "ingredients": "Mango,Whipped Cream,Curd,Sugar,Dry Fruits,Ice cubes",
        "directions": "Take a mixer jar.Add mango puree 2 tbspn curd,ice-cubes,sugar and grind it. Sweet lassi is ready. Now,take a bowl. Add whipped cream and mango puree and 1 tbspn sugar. Mix well. Now take a glass. Add sweet mango lassi in it then add mango mixture over it. After that add mango chunks on it. Garnish it with dry fruits. Finally, Chilled Mango Dalgona lassi is ready to serve. Serve it with love.....😋",
        "description": "Mango Dalgona Lassi, loaded with creamy dreamy mango cream, plain rich yogurt based liquid and hint of cardamom saffron pistachio, best summery beverage!",
        "calories": "450",
        "image": "https://www.indianveggiedelight.com/wp-content/uploads/2020/08/mango-lassi-featured-720x722.jpg"
    },
    {
        "id": 5,
        "name": "Masala Papad",
        "ingredients": "Chane(black chickpeas),Papad,Chopped Cheese,Chopped Onion,Chopped Tomato,Chopped Green Chilli,Chopped Coriander Leaves,Grated Cheese,Chat Masala,Salt,Red Chilli Powder,Lemon Juice",
        "directions": "Firstly, take all the ingredients. Special Masala Papad recipe step 1 photo Add all dried maslas and mix well. Masala is ready for Masala Papad Special Masala Papad recipe step 2 photo Special Masala Papad recipe step 2 photo Then roast the papad and lay the Papad on the serving platter. Special Masala Papad recipe step 3 photo Special Masala Papad recipe step 3 photo Special Masala Papad recipe step 3 photo Top the papad with mixture and garnish it with onion,tomato, cheese and coriander leaves. Finally, Special Masala Papad is ready to serve. Serve it with love❤😋",
        "description": "The crispy papad is topped with a spicy and tangy mixture of onions, tomatoes, green chilies, cilantro (coriander leaves), salt, chaat masala powder, red chili powder, and lime juice.",
        "calories": "750",
        "image": "https://www.flavourstreat.com/wp-content/uploads/2022/05/masala-papad-001.jpg"
    },
    {
        "id": 6,
        "name": "Dal Makhni",
        "ingredients": "Udad dal, Rajma(kidney beans), Water, Black Cardamom, Onion, Tomatoes, Ginger, Garlic Green Chilli, Salt, Red Chilli powder, Turmeric powder, Dry coriander powder, Garam masala, Black pepper powder, Coriander leaves, Fresh cream(malai), Milk, Cashew, Cumin seeds, Desi ghee/oil",
        "directions": "Firstly wash the daal and rajma.Take a big bowl,add udad daal and rajma then soak it for 3-4 hours. After that take a pressure cooker, add soaked daal,rajma,water,salt,black cardemom. Cover the lid and cook it till 6-7 whistle at medium flame. Take a pan or kadhai and add ghee and add cumin seeds into the pan/kadhai. Special Dal Makhni recipe step 4 photo Special Dal Makhni recipe step 4 photo Now, grind onion,garlic,ginger,coriander leaves,green chilli and tomatoes. Special Dal Makhni recipe step 5 photo Special Dal Makhni recipe step 5 photo Onion and tomato paste is ready. Special Dal Makhni recipe step 6 photo Add onion paste in kadhai and saute it for 1-2 minutes. Then add tomato paste or puree in it and cook it. Special Dal Makhni recipe step 7 photo Special Dal Makhni recipe step 7 photo Add turmeric powder, salt, red chilli powder, dry coriander powder, garam masala and mix it. After that add fresh cream and mix well and add boiled daal and cook it for 1-2 minutes. Special Dal Makhni recipe step 8 photo Daal makhni is ready to serve. Serve it with love.....❤😋",
        "description": "Dal makhani is a dish originating in New Delhi, India. A relatively modern variation of traditional lentil dishes, it is made with urad dal and other pulses, and includes butter and cream",
        "calories": "450",
        "image": "https://www.vegrecipesofindia.com/wp-content/uploads/2015/01/dal-makhani-recipe-1.jpg"
    },
    {
        "id": 7,
        "name": "Fruit Custard",
        "ingredients": "Milk, Sugar, Cardamom powder, Custard powder, Chopped apple, Chopped kiwi, Pomegranate, Cake pieces, Whipped cream",
        "directions": "Add 3,4 cups milk to a heavy bottom pan on medium heat. Fruit Custard recipe step 1 photo Once it has been heated up a little, take out 3 tbspn milk from the pan into a small bowl.Add in 3 tbspn custard powder to that milk and mix well. There should be no lumps. Set it aside Fruit Custard recipe step 2 photo Stir the milk in the pan in between and let it heat and come to a gentle boil. Then lower the heat, add sugar and mix untill combined. Start adding the custard mix. Fruit Custard recipe step 3 photo Add little at a time and mix after each addition. Whisk continuously. Cook for 2-3 minutes untill the custard thickens. Remove pan from heat and let it cool down a bit. Add cardamom powder. Then cover and place in the refrigerator to chill. Fruit Custard recipe step 4 photo Now, take cake,whipped cream,chopped dry fruits and chopped all fruits that you are using for the custard and it in serving bowl and refrigerate. Fruit Custard recipe step 5 photo Fruit Custard recipe step 5 photo Fruit Custard recipe step 5 photo Transfer custard to serving bowl and mix in the fruits and dry fruits. Cover and refrigerate the custard for 1-2 hours.",
        "image": "https://www.whiskaffair.com/wp-content/uploads/2020/05/Fruit-Custard-2-3.jpg",
        "description": "Fruit custard is a dessert made by mixing chopped seasonal fruits with chilled cusard sauce. Custard is a saucy dish that was traditionally prepared with cream,",
        "calories": "300"
    },
    {
        "id": 8,
        "directions": "Heat oil in a kadhai add mustard seeds saute it add chopped onion and saute it till it loses its raw taste. Fried rice recipe step 1 photo Add all spices and mix well add boiled rice and Cook for 5 to 10 minutes. Fried rice recipe step 2 photo Fried rice recipe step 2 photo Fried rice is ready to Serve.",
        "name": "Fried rice",
        "ingredients": "Rice, Onion, Oil, Mustard seeds, Green chilli, Red chilli powder, Salt",
        "calories": "390",
        "image": "https://www.funfoodfrolic.com/wp-content/uploads/2021/10/Fried-Rice-Blog-Thumbnail.jpg",
        "description": "Fried rice is a dish of cooked rice that has been stir-fried in a wok or a frying pan and is usually mixed with other ingredients such as eggs, vegetables, seafood, or meat. It is often eaten by itself or as an accompaniment to another dish."
    },
    {
        "id": 9,
        "directions": "Fried rice is a dish of cooked rice that has been stir-fried in a wok or a frying pan and is usually mixed with other ingredients such as eggs, vegetables, seafood, or meat. It is often eaten by itself or as an accompaniment to another dish.",
        "ingredients": "rice 1/2 cup urad dal 1/2 Tsp methi seeds 1 cup poha Water to soak Salt as required Oil for roasting The veggies 1 onion finely chopped 1 tomato finely chopped 1 carrot chopped 1/2 green capsicums chopped 1/4 cup chopped beetroot 1 inch ginger chopped 1 green chilli chopped leaves Few chopped curry 1/4 tsp salt",
        "name": "Mixed Veg Uttapam",
        "image": "https://i.pinimg.com/originals/71/30/7c/71307c517b878f59680b7ad8ff310554.jpg",
        "calories": "670",
        "description": "An uttapam is a type of dosa from South India. Unlike a typical dosa, which is crisp and crepe-like, an uttapam is thicker, with toppings."
    },
    {
        "id": 10,
        "name": "Mathura Peda",
        "description": "Peda or Pera is a sweet dish hailing from the Indian subcontinent. It originated from Mathura, Uttar Pradesh, India. Usually prepared in thick, semi-soft pieces, its main ingredients are khoa, sugar and traditional flavorings including cardamom seeds, pistachio nuts and saffro",
        "ingredients": "1 Tsp ghee 1/2 cup cow milk Rest ingredients 2 Tsp ghee 3 Tbsp cow milk 3 Tbsp powder sugar 1/6 Tsp cardamom Few drops Kewra essences",
        "directions": "Heat 1 Tsp ghee in a pan. Add cow milk and milk powder. Mathura Peda recipe step 1 photo Add 1 Tsp ghee and break Mawa into pieces and cook till it crumbs. Mathura Peda recipe step 2 photo When the Mawa dries add 2 Tsp milk and saute till the colour change brown. Mathura Peda recipe step 3 photo Cool blend to powder with sugar and cardamom seeds. Mathura Peda recipe step 4 photo Mathura Peda recipe step 4 photo Keep the flame low throughout the cooking and stir continuously till the mixture thickens and without lumps. Mathura Peda recipe step 5 photo Then add 2 Tsp milk, Kewra essences and mix the mixture well. Divine the mixture and make peda. Garnish with chopped pista and offer to the Deity. Mathura Peda recipe step 6 photo Mathura Peda recipe step 6 photo Mathura Peda recipe step 6 photo Jai Shree Krishna",
        "calories": "900",
        "image": "https://www.vegrecipesofindia.com/wp-content/uploads/2017/10/peda-recipe-2.jpg"
    }
]