[
    {
        "id":1,
        "name":"Pani Puri",
        "ingredients":"Potatoes,Onion,chopped coriander,roasted cumin powder,chaat masala powder,red chili powder,black salt or regular salt or pink salt,chopped mint leaves,ginger,green chilies,tamarind,jaggery powder,water,boondi",
        "directions":"Rinse 1 cup tightly packed coriander leaves, ½ cup tightly packed mint leaves, 2 to 3 green chilies and 1 inch ginger very well in water a few times. Drain all the water. Peel the ginger and roughly chop it. Also chop the green chilies. Roughly chop the coriander leaves and mint leaves. Do not use the stem of mint leaves as they can make the spiced water have a bitter taste. Only use the fresh mint leaves. Add coriander leaves, mint leaves, ginger and green chili in a grinder or blender jar. For a less spicy pani you can add just 1 chopped green chilli. Add 1 tablespoon tightly packed tamarind and 3.5 to 4 tablespoons jaggery powder or grated jaggery. If you do not have tamarind, then you can use 2 tablespoons lemon juice. You can also use equal amounts of jaggery and dates. So you can add 2 tablespoons crumbled jaggery and 2 tablespoons chopped dates. Now add 1 teaspoon roasted cumin powder, 1 teaspoon chaat masala and salt as per taste. You can also use a mix of black salt and pink salt or regular salt. I personally prefer to use either black salt or edible rock salt. Add ⅓ cup water and grind to a smooth consistency. Remove the chutney to a bowl or a small pan. Now add ½ cup water in the grinder jar and swirl the jar so that the chutney at the sides of the jar gets mixed with the water. Add this water to the bowl containing the chutney. Then add ½ to ¾ cup water. You can add less or more water depending on the consistency you want. But do not add too much water as then the taste and flavor of the spiced water reduces. Also check the taste and if required you can add some more jaggery or salt as required. Mix very well. Cover the pan and refrigerate the pani. Before refrigerating you can also add 1 to 1.5 tablespoons of salted boondi. Boondi also gives a good taste. It can also be made at home or purchased easily from grocery stores. Boil 2 to 3 medium-sized potatoes. You can boil or steam the potatoes in a pan, instant pot or stovetop pressure cooker adding water as required. When warm, peel them and chop them into small cubes. You can also add some steamed or boiled moong sprouts. Some finely chopped onions can also be added. I have added 1 small-sized finely chopped onion. Add 1 to 1.5 tablespoon chopped coriander leaves. Then add ¼ teaspoon red chili powder, 1 teaspoon chaat masala and 1 teaspoon roasted cumin powder. Also add salt as per taste. Stir and mix very well. Keep aside.",
        "description":"Panipuri, phuchka, gupchup, golgappa, or pani ke patashe is a type of snack that originates from India, and is one of the most common street foods there.",
        "calories":"350",
        "image":"https://www.vegrecipesofindia.com/wp-content/uploads/2021/09/pani-puri-1-280x280.jpg"
    },
    {
        "id":2,
        "name":"Maggi",
        "ingredients":"Maggi noodles,Salt,Turmeric powder,Black-pepper powder,Tomato ketchup,Water",
        "directions":"Take water in the pan and bring it to boil.Add Maggi seasoning, salt,turmeric powder and black- pepper powder to it. Add Maggi noodles. Bring it to boil on high flame and then reduce the heat. Add tomato ketchup. Allow it to cook on simmer for a couple of minutes. Now, serve the Maggi noodles.",
        "description":"Maggi is an international brand of seasonings, instant soups, and noodles that originated in Switzerland in the late 19th century. The Maggi company was acquired by Nestlé in 1947.",
        "calories":"200",
        "image":"https://img-global.cpcdn.com/recipes/b9a676575b60fe36/680x482cq70/plain-maggi-noodles-recipe-main-photo.webp"
    },
    {
        "id":3,
        "name":"Watermelon Mint Juice",
        "ingredients":"Watermelon,Mint Leaves,Sugar,Ice-cubes",
        "directions":"Take the chilled watermelon and cut into half. Farmhouse Watermelon Mint Juice recipe step 1 photo Farmhouse Watermelon Mint Juice recipe step 1 photo Then cut the watermelon into small pieces. Farmhouse Watermelon Mint Juice recipe step 2 photo Now, take some fresh mint leaves and blend them with the watermelon in mixer or juicer. Then add sugar. Strain it into another vessel if blending in a normal mixer. Farmhouse Watermelon Mint Juice recipe step 3 photo Farmhouse Watermelon Mint Juice recipe step 3 photo After that pour this Farmhouse Watermelon Mint Juice in the glaases, garnish it with a mint leaf or leaves and pieces of watermelon and serve immediately....😋",
        "description":"Blend the watermelon and mint to a puree in a blender or using a hand blender. Keep a few watermelon cubes and mint leaves aside for serving.",
        "calories":"550",
        "image":"https://img-global.cpcdn.com/recipes/fb37374425626f59/680x482cq70/farmhouse-watermelon-mint-juice-recipe-main-photo.webp"
    },
    {
        "id":4,
        "name":"Mango Dalgona Lassi",
        "ingredients":"Mango,Whipped Cream,Curd,Sugar,Dry Fruits,Ice cubes",
        "directions":"Take a mixer jar.Add mango puree 2 tbspn curd,ice-cubes,sugar and grind it. Sweet lassi is ready. Now,take a bowl. Add whipped cream and mango puree and 1 tbspn sugar. Mix well. Now take a glass. Add sweet mango lassi in it then add mango mixture over it. After that add mango chunks on it. Garnish it with dry fruits. Finally, Chilled Mango Dalgona lassi is ready to serve. Serve it with love.....😋",
        "description":"Mango Dalgona Lassi, loaded with creamy dreamy mango cream, plain rich yogurt based liquid and hint of cardamom saffron pistachio, best summery beverage!",
        "calories":"450",
        "image":"https://myvegetarianroots.com/wp-content/uploads/2020/06/DSC_0184.jpeg"
    },
    {
        "id":5,
        "name":"Masala Papad",
        "ingredients":"Chane(black chickpeas),Papad,Chopped Cheese,Chopped Onion,Chopped Tomato,Chopped Green Chilli,Chopped Coriander Leaves,Grated Cheese,Chat Masala,Salt,Red Chilli Powder,Lemon Juice",
        "directions":"Firstly, take all the ingredients. Special Masala Papad recipe step 1 photo Add all dried maslas and mix well. Masala is ready for Masala Papad Special Masala Papad recipe step 2 photo Special Masala Papad recipe step 2 photo Then roast the papad and lay the Papad on the serving platter. Special Masala Papad recipe step 3 photo Special Masala Papad recipe step 3 photo Special Masala Papad recipe step 3 photo Top the papad with mixture and garnish it with onion,tomato, cheese and coriander leaves. Finally, Special Masala Papad is ready to serve. Serve it with love❤😋",
        "description":"The crispy papad is topped with a spicy and tangy mixture of onions, tomatoes, green chilies, cilantro (coriander leaves), salt, chaat masala powder, red chili powder, and lime juice.",
        "calories":"750",
        "image":"https://img-global.cpcdn.com/recipes/e938437f67f71d80/680x482cq70/special-masala-papad-recipe-main-photo.webp"
    }
   
]